{
  "projects": [
    {
      "slug": "wind-turbine-fault-prediction",
      "title": "Wind Turbine Fault Prediction with SVM, PCA and LDA",
      "summary": "Technical-business analysis of an AI pipeline for the wind sector for early fault detection using only current signatures.",
      "role": "Researcher",
      "duration": "Mestrado",
      "context": "Unplanned wind turbine downtime can reach 237 h/year, directly affecting revenue and increasing maintenance costs. The proposed method uses only generator current signatures — a non-invasive approach that reduces CAPEX and OPEX — and achieves 97.6% accuracy in early fault detection.",
      "challenge": "Develop a non-invasive and accurate method for fault detection in wind turbines, using only generator electrical signals, without the need for additional sensors.",
      "decisions": [
        "Synthetic database construction using TurbSim (wind), FAST (GE 1.5s turbine) and MATLAB/Simulink (PMSG generator)",
        "Preprocessing with PCA (99.99% variance) and LDA (6 components)",
        "Modeling via SVM with RBF kernel and optimization via Grid-Search (10-fold CV)",
        "Benchmark against k-NN, QDA, Trees, RF, AdaBoost, ANN and linear SVM"
      ],
      "results": [
        "Global accuracy of 97.6% with F1 ≥ 0.92 in all classes",
        "98% reduction in dataset size after PCA + LDA",
        "Hyperparameter search time reduced to ~2 min",
        "Method superior to competitors in all evaluated metrics"
      ],  
      "stack": [
        "Python",
        "Scikit-learn",
        "MATLAB/Simulink",
        "SVM",
        "PCA/LDA",
        "MLOps",
        "Data Engineering"
      ],
      "image": "/images/projects/wind-turbine-fault-prediction/icon.png",
      "repoLink": "https://github.com/kauedelazzeri/Wind-Turbine-Fault-Prediction",
      "featured": true
    },
    {
      "slug": "movie-genre-prediction",
      "title": "Movie Genre Prediction Based on Posters",
      "summary": "Analysis of movie genre classification using convolutional neural networks and transfer learning to identify visual patterns in movie posters.",
      "role": "Researcher & Developer",
      "duration": "2024",
      "context": "Automatic movie genre classification has important applications in streaming, content recommendation, and market analysis. By using only posters — already available and standardized resources — the method reduces implementation costs and provides valuable insights into cinema's visual communication.",
      "challenge": "Develop a deep learning model capable of identifying visual patterns in movie posters and classifying them into movie genres with high accuracy, using only visual information.",
      "decisions": [
        "Implementation of two architectures: custom neural network and VGG16 with transfer learning",
        "Dataset of 45,000+ posters collected via TMDB API",
        "Preprocessing with data augmentation and class balancing",
        "Fine-tuning VGG16 for multiclass classification"
      ],
      "results": [
        "Global accuracy of 85% in classifying major genres",
        "Inference time less than 100ms per image",
        "Identification of genre-specific visual patterns",
        "REST API for real-time classification"
      ],
      "stack": [
        "Python",
        "PyTorch",
        "Computer Vision",
        "Deep Learning",
        "Transfer Learning",
        "CNN",
        "MLOps"
      ],
      "image": "/images/projects/movie-genre-prediction/icon.png",
      "repoLink": "https://github.com/kauedelazzeri/movie-genre-prediction",
      "featured": true
    },
    {
      "slug": "aposta-facil",
      "title": "MVP Social Betting Platform",
      "summary": "A social betting platform focused on user engagement and retention through gamification and social features.",
      "role": "Product Manager",
      "duration": "2023-2024",
      "context": "Development of a social betting platform that combines traditional sports betting with social media elements to increase user engagement and lifetime value.",
      "challenge": "Create a betting platform that stands out in a competitive market by focusing on social interaction and user experience rather than just odds and payouts.",
      "decisions": [
        "Implementation of social features like friend challenges and leaderboards",
        "Gamification system with points, badges, and levels",
        "Real-time chat and comment system for events",
        "Mobile-first responsive design approach"
      ],
      "results": [
        "30% increase in user retention compared to traditional platforms",
        "Average session time of 45 minutes",
        "User acquisition cost reduced by 25% through referral system",
        "90% mobile usage adoption rate"
      ],
      "stack": [
        "React Native",
        "Node.js",
        "PostgreSQL",
        "AWS",
        "WebSocket",
        "Redis",
        "Product Management"
      ],
      "image": "/images/projects/aposta-facil/icon.svg",
      "featured": true
    }
  ]
}
